["Kenneth went cheap on the gemstone present for Michael and _ was understanding about being a cheapskate.\nKenneth - Michael", "There were more holes in the yard of Amy than Carrie because _ had less dogs at their home.\nAmy - Carrie", "The dog didn't like its collar but was okay with its leash because the _ was loose on it.\ncollar - leash", "The door opened louder than the window because the _ had less grease on its hinges.\nwindow - door", "The door opened louder than the window because the _ had more grease on its hinges.\nwindow - door", "Kayla uses more oil when they cook than Monica does, so _ has tastier dishes on average.\nKayla - Monica", "Kayla uses more oil when they cook than Monica does, so _ has blander dishes on average.\nKayla - Monica", "Mary stopped by Samantha's house during breakfast time so _ offered her a waffle and orange juice.\nMary - Samantha", "Mary stopped by Samantha's house during breakfast time so _ was offered a waffle and orange juice.\nMary - Samantha", "She rejected fur for her coat, but thought it would be nice for her hat.  The fur was excessively warm for the _ .\ncoat - hat", "I tried to dry my towel in the dryer but it took multiple cycles because the _  was very narrow.\ntowel - dryer", "Amy had a boyfriend. Angela did not. This was a result of the fact that _ was attracted to men.\nAmy - Angela", "To sing better to the audience, he used his voice and gave up on the guitar. The _ was electric.\nvoice - guitar", "With the washing machine broken, Hunter took Benjamin's clothes to the laundromat, because _ had to work that day.\nHunter - Benjamin", "With the washing machine broken, Hunter took Benjamin's clothes to the laundromat, since _ had the day off that day.\nHunter - Benjamin", "We had to make a bid on the item instead of just making a purchase, because the _ would be lower.\npurchase - bid", "We had to make a bid on the item instead of just making a purchase, because the _ would be higher.\npurchase - bid", "Patricia bet on the opposite team as Katrina and lost, so _ was angry with their choice.\nPatricia - Katrina", "Michael bought Robert a new rug at the store, because _ needed help to decorate their new home.\nMichael - Robert", "Neil always helped him with the groceries while Christopher never helped him with anything. He told _ that he will include him in his will.\nNeil - Christopher"]